---
kind: type
id: T:Autodesk.Revit.DB.AnnotationSymbol
source: html/b8ea2b7b-6d1c-d0d3-aaf3-b95003c385b8.htm
---
# Autodesk.Revit.DB.AnnotationSymbol

This object represents a symbol of the Generic Annotation.

## Syntax (C#)
```csharp
public class AnnotationSymbol : FamilyInstance
```

## Remarks
Inheritance Hierarchy System.Object    Autodesk.Revit.DB.Element      Autodesk.Revit.DB.Instance        Autodesk.Revit.DB.FamilyInstance          Autodesk.Revit.DB.AnnotationSymbol